#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-4PUaNAJ8Ts4pEg9n

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfprovidercloudinit_repo_4E4D12FF: Refreshing state... [id=cdktf-provider-cloudinit]
github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7: Refreshing state... [id=cdktf-provider-postgresql]
github_repository.repos_cdktfproviderlocal_repo_4D7B21AD: Refreshing state... [id=cdktf-provider-local]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfproviderarchive_repo_F28A4A49: Refreshing state... [id=cdktf-provider-archive]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3: Refreshing state... [id=cdktf-provider-pagerduty]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_repository.repos_cdktfprovidertls_repo_E6EAEEBE: Refreshing state... [id=cdktf-provider-tls]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfproviderazuread_repo_A398ECE6: Refreshing state... [id=cdktf-provider-azuread]
github_actions_secret.repos_cdktfproviderrandom_repo_secretghtoken_BF621699: Refreshing state... [id=cdktf-provider-random:GH_TOKEN]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavengpgprivatekeypassphrase_EAE13F98: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderrandom_repo_secretnpmtoken_EB9E9D15: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderrandom_repo_secretnugetapikey_08898A3C: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavengpgprivatekey_4F3BF592: Refreshing state... [id=cdktf-provider-random:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenusername_6DD2B472: Refreshing state... [id=cdktf-provider-random:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenstagingprofileid_902F675E: Refreshing state... [id=cdktf-provider-random:MAVEN_STAGING_PROFILE_ID]
github_branch_protection.repos_cdktfproviderrandom_mainprotection_A087F18D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzU=]
github_actions_secret.repos_cdktfproviderrandom_repo_secrettwineusername_8B3D5E1D: Refreshing state... [id=cdktf-provider-random:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderrandom_automergelabel_94219122: Refreshing state... [id=cdktf-provider-random:automerge]
github_actions_secret.repos_cdktfproviderrandom_repo_secretmavenpassword_60CAFD38: Refreshing state... [id=cdktf-provider-random:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderrandom_repo_secrettwinepassword_D1D2F338: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_issue_label.repos_cdktfrepositorymanager_automergelabel_67A6BDF7: Refreshing state... [id=cdktf-repository-manager:automerge]
github_actions_secret.repos_cdktfrepositorymanager_repo_secretghcommenttoken_58A9B9E8: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_cdktfrepositorymanager_repo_secrettfcloudtoken_F5D4A22D: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_branch_protection.repos_cdktfprovidergoogle_mainprotection_2D089CC1: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODA=]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenpassword_E3D574C6: Refreshing state... [id=cdktf-provider-google:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretnpmtoken_679FDFB7: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidergoogle_repo_secrettwinepassword_46DD5755: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidergoogle_repo_secrettwineusername_8F52E212: Refreshing state... [id=cdktf-provider-google:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretghtoken_E4A89BC8: Refreshing state... [id=cdktf-provider-google:GH_TOKEN]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavengpgprivatekey_A85C1B05: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavengpgprivatekeypassphrase_920DD1ED: Refreshing state... [id=cdktf-provider-google:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenusername_949E0421: Refreshing state... [id=cdktf-provider-google:MAVEN_USERNAME]
github_issue_label.repos_cdktfprovidergoogle_automergelabel_359F63C4: Refreshing state... [id=cdktf-provider-google:automerge]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretmavenstagingprofileid_155BE188: Refreshing state... [id=cdktf-provider-google:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidergoogle_repo_secretnugetapikey_1DE39322: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_issue_label.repos_cdktfproviderlocal_automergelabel_C0E7761B: Refreshing state... [id=cdktf-provider-local:automerge]
github_actions_secret.repos_cdktfproviderlocal_repo_secretghtoken_DBC651EC: Refreshing state... [id=cdktf-provider-local:GH_TOKEN]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavengpgprivatekeypassphrase_FA1FEC93: Refreshing state... [id=cdktf-provider-local:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderlocal_repo_secretnpmtoken_2DDEB7C4: Refreshing state... [id=cdktf-provider-local:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavengpgprivatekey_A6426E42: Refreshing state... [id=cdktf-provider-local:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenusername_927EABFE: Refreshing state... [id=cdktf-provider-local:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderlocal_repo_secretnugetapikey_2F71182F: Refreshing state... [id=cdktf-provider-local:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderlocal_repo_secrettwineusername_CC22F1DB: Refreshing state... [id=cdktf-provider-local:TWINE_USERNAME]
github_branch_protection.repos_cdktfproviderlocal_mainprotection_2BB09763: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTg=]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenpassword_780EDEC8: Refreshing state... [id=cdktf-provider-local:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderlocal_repo_secretmavenstagingprofileid_BE854BB2: Refreshing state... [id=cdktf-provider-local:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderarchive_repo_secrettwineusername_C03FAF4F: Refreshing state... [id=cdktf-provider-archive:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavengpgprivatekey_4C753FBA: Refreshing state... [id=cdktf-provider-archive:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenstagingprofileid_CF2B69CA: Refreshing state... [id=cdktf-provider-archive:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavengpgprivatekeypassphrase_5B346E0B: Refreshing state... [id=cdktf-provider-archive:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderlocal_repo_secrettwinepassword_8AA06A3E: Refreshing state... [id=cdktf-provider-local:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderarchive_repo_secretnpmtoken_B291E237: Refreshing state... [id=cdktf-provider-archive:NPM_TOKEN]
github_issue_label.repos_cdktfproviderarchive_automergelabel_869BB088: Refreshing state... [id=cdktf-provider-archive:automerge]
github_branch_protection.repos_cdktfproviderarchive_mainprotection_71039C33: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTU=]
github_actions_secret.repos_cdktfproviderarchive_repo_secrettwinepassword_3B832C1B: Refreshing state... [id=cdktf-provider-archive:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenpassword_C2AECDEC: Refreshing state... [id=cdktf-provider-archive:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderarchive_repo_secretnugetapikey_B91B53D7: Refreshing state... [id=cdktf-provider-archive:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderarchive_repo_secretmavenusername_227B10FC: Refreshing state... [id=cdktf-provider-archive:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderarchive_repo_secretghtoken_A241E972: Refreshing state... [id=cdktf-provider-archive:GH_TOKEN]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretnugetapikey_3AFDBD97: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenpassword_41DAD2C0: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secrettwinepassword_35F66B64: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderkubernetes_mainprotection_98A1BD1D: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0Nzg=]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretnpmtoken_7FE4E99F: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretghtoken_CAFEC39F: Refreshing state... [id=cdktf-provider-kubernetes:GH_TOKEN]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavengpgprivatekey_439956B6: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.repos_cdktfproviderkubernetes_automergelabel_1FA4EB21: Refreshing state... [id=cdktf-provider-kubernetes:automerge]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenusername_3569950A: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavengpgprivatekeypassphrase_5FA7874D: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secretmavenstagingprofileid_248C2B94: Refreshing state... [id=cdktf-provider-kubernetes:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderkubernetes_repo_secrettwineusername_ED14A2E5: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secrettwineusername_164AD03B: Refreshing state... [id=cdktf-provider-cloudinit:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenpassword_C7609DFA: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenusername_1FB8DD9C: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_USERNAME]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavengpgprivatekeypassphrase_9885DB69: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavengpgprivatekey_421E0DDB: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretnpmtoken_5760A604: Refreshing state... [id=cdktf-provider-cloudinit:NPM_TOKEN]
github_issue_label.repos_cdktfprovidercloudinit_automergelabel_1CEE9EB2: Refreshing state... [id=cdktf-provider-cloudinit:automerge]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretmavenstagingprofileid_0EF608B6: Refreshing state... [id=cdktf-provider-cloudinit:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretghtoken_16D4D489: Refreshing state... [id=cdktf-provider-cloudinit:GH_TOKEN]
github_branch_protection.repos_cdktfprovidercloudinit_mainprotection_22F8B7FC: Refreshing state... [id=BPR_kwDOGR9aGs4BWiI7]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secrettwinepassword_89266796: Refreshing state... [id=cdktf-provider-cloudinit:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavengpgprivatekeypassphrase_24B3C139: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidercloudinit_repo_secretnugetapikey_26277B85: Refreshing state... [id=cdktf-provider-cloudinit:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidergithub_repo_secretnugetapikey_B679961E: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidergithub_repo_secretnpmtoken_241DA344: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavengpgprivatekey_00174A0A: Refreshing state... [id=cdktf-provider-github:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidergithub_repo_secrettwineusername_9AE478B0: Refreshing state... [id=cdktf-provider-github:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidergithub_repo_secrettwinepassword_7DE22D13: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_branch_protection.repos_cdktfprovidergithub_mainprotection_D33DAB1E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzY=]
github_actions_secret.repos_cdktfprovidergithub_repo_secretghtoken_EA7D4EA6: Refreshing state... [id=cdktf-provider-github:GH_TOKEN]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenstagingprofileid_52590AFD: Refreshing state... [id=cdktf-provider-github:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenpassword_5A029ABB: Refreshing state... [id=cdktf-provider-github:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovidergithub_repo_secretmavenusername_7EB8800A: Refreshing state... [id=cdktf-provider-github:MAVEN_USERNAME]
github_issue_label.repos_cdktfprovidergithub_automergelabel_CB4CF729: Refreshing state... [id=cdktf-provider-github:automerge]
github_actions_secret.repos_cdktfproviderexternal_repo_secrettwineusername_9A179303: Refreshing state... [id=cdktf-provider-external:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderexternal_automergelabel_88E85FD0: Refreshing state... [id=cdktf-provider-external:automerge]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavengpgprivatekey_5EFE7282: Refreshing state... [id=cdktf-provider-external:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderexternal_repo_secretghtoken_5D42DDE5: Refreshing state... [id=cdktf-provider-external:GH_TOKEN]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavengpgprivatekeypassphrase_945756E6: Refreshing state... [id=cdktf-provider-external:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenstagingprofileid_69373C76: Refreshing state... [id=cdktf-provider-external:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenpassword_514CA805: Refreshing state... [id=cdktf-provider-external:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderexternal_repo_secrettwinepassword_FBA9E7DA: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderexternal_repo_secretmavenusername_DCFCE305: Refreshing state... [id=cdktf-provider-external:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderexternal_repo_secretnugetapikey_803FF61F: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderexternal_repo_secretnpmtoken_9E671E6B: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_branch_protection.repos_cdktfproviderexternal_mainprotection_A8EFF040: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODY=]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenstagingprofileid_AC87200E: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavengpgprivatekey_D0967044: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavengpgprivatekeypassphrase_8FBBA023: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretnugetapikey_BD7007D3: Refreshing state... [id=cdktf-provider-postgresql:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenusername_FAD21036: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_USERNAME]
github_branch_protection.repos_cdktfproviderpostgresql_mainprotection_BE8DB09C: Refreshing state... [id=BPR_kwDOGR9aB84BWiJK]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretmavenpassword_87D10804: Refreshing state... [id=cdktf-provider-postgresql:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretnpmtoken_C48EAD8D: Refreshing state... [id=cdktf-provider-postgresql:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secrettwineusername_60095520: Refreshing state... [id=cdktf-provider-postgresql:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secretghtoken_35AD4AD8: Refreshing state... [id=cdktf-provider-postgresql:GH_TOKEN]
github_issue_label.repos_cdktfproviderpostgresql_automergelabel_DD5AD89C: Refreshing state... [id=cdktf-provider-postgresql:automerge]
github_actions_secret.repos_cdktfproviderpostgresql_repo_secrettwinepassword_7F63E4F3: Refreshing state... [id=cdktf-provider-postgresql:TWINE_PASSWORD]
github_issue_label.repos_cdktfproviderproject_automergelabel_314CBFA5: Refreshing state... [id=cdktf-provider-project:automerge]
github_actions_secret.repos_cdktfproviderproject_repo_secretnpmtoken_BB8123FF: Refreshing state... [id=cdktf-provider-project:NPM_TOKEN]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B: Refreshing state... [id=3949435:cdktf-provider-archive]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfprovidercloudinit_managingteam_8459E4BF: Refreshing state... [id=3949435:cdktf-provider-cloudinit]
github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60: Refreshing state... [id=3949435:cdktf-provider-local]
github_team_repository.repos_cdktfproviderpostgresql_managingteam_C34F4034: Refreshing state... [id=3949435:cdktf-provider-postgresql]
github_actions_secret.repos_cdktfprovidernull_repo_secrettwinepassword_3CD8CD41: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]
github_actions_secret.repos_cdktfprovidernull_repo_secretghtoken_7C4A936B: Refreshing state... [id=cdktf-provider-null:GH_TOKEN]
github_branch_protection.repos_cdktfprovidernull_mainprotection_B3BB4873: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0NzQ=]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavengpgprivatekeypassphrase_C0157038: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovidernull_repo_secretnpmtoken_298712D1: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidernull_repo_secretnugetapikey_DC71C82B: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenpassword_C4473759: Refreshing state... [id=cdktf-provider-null:MAVEN_PASSWORD]
github_issue_label.repos_cdktfprovidernull_automergelabel_EAE50ED1: Refreshing state... [id=cdktf-provider-null:automerge]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavengpgprivatekey_296F5999: Refreshing state... [id=cdktf-provider-null:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidernull_repo_secrettwineusername_4BB0B052: Refreshing state... [id=cdktf-provider-null:TWINE_USERNAME]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenstagingprofileid_B6129E18: Refreshing state... [id=cdktf-provider-null:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidernull_repo_secretmavenusername_54BA77A9: Refreshing state... [id=cdktf-provider-null:MAVEN_USERNAME]
github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F: Refreshing state... [id=3949435:cdktf-provider-pagerduty]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretghtoken_E4C87873: Refreshing state... [id=cdktf-provider-pagerduty:GH_TOKEN]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secrettwinepassword_E227B318: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenstagingprofileid_31A2C6C1: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secrettwineusername_7C8BAF73: Refreshing state... [id=cdktf-provider-pagerduty:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderpagerduty_automergelabel_C6025DF6: Refreshing state... [id=cdktf-provider-pagerduty:automerge]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretnpmtoken_5ADAEEF5: Refreshing state... [id=cdktf-provider-pagerduty:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretnugetapikey_59B61229: Refreshing state... [id=cdktf-provider-pagerduty:NUGET_API_KEY]
github_branch_protection.repos_cdktfproviderpagerduty_mainprotection_18096071: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA2OTA=]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenpassword_799348D7: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavengpgprivatekey_2DAD8646: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavenusername_C6E69A4C: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenstagingprofileid_82131E11: Refreshing state... [id=cdktf-provider-docker:MAVEN_STAGING_PROFILE_ID]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavengpgprivatekeypassphrase_D001A76D: Refreshing state... [id=cdktf-provider-docker:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderpagerduty_repo_secretmavengpgprivatekeypassphrase_1B038222: Refreshing state... [id=cdktf-provider-pagerduty:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_branch_protection.repos_cdktfproviderdocker_mainprotection_BFFE8D77: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODM=]
github_actions_secret.repos_cdktfproviderdocker_repo_secretghtoken_F0BE8962: Refreshing state... [id=cdktf-provider-docker:GH_TOKEN]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenusername_9BCF44A1: Refreshing state... [id=cdktf-provider-docker:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavengpgprivatekey_BA6F5E6A: Refreshing state... [id=cdktf-provider-docker:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderdocker_repo_secrettwineusername_C6A649BD: Refreshing state... [id=cdktf-provider-docker:TWINE_USERNAME]
github_issue_label.repos_cdktfproviderdocker_automergelabel_70197107: Refreshing state... [id=cdktf-provider-docker:automerge]
github_actions_secret.repos_cdktfproviderdocker_repo_secretmavenpassword_078D78B7: Refreshing state... [id=cdktf-provider-docker:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderdocker_repo_secretnugetapikey_A9805D12: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_team_repository.repos_cdktfprovidertls_managingteam_B495FE84: Refreshing state... [id=3949435:cdktf-provider-tls]
github_actions_secret.repos_cdktfproviderdocker_repo_secretnpmtoken_3291CA83: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderdocker_repo_secrettwinepassword_9FA7C132: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidertls_repo_secrettwineusername_B5394966: Refreshing state... [id=cdktf-provider-tls:TWINE_USERNAME]
github_branch_protection.repos_cdktfprovidertls_mainprotection_B0EFA7F1: Refreshing state... [id=BPR_kwDOGR5adc4BWhWt]
github_actions_secret.repos_cdktfprovidertls_repo_secrettwinepassword_DECFDEB9: Refreshing state... [id=cdktf-provider-tls:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenstagingprofileid_9250D638: Refreshing state... [id=cdktf-provider-tls:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenusername_0D38F518: Refreshing state... [id=cdktf-provider-tls:MAVEN_USERNAME]
github_actions_secret.repos_cdktfprovidertls_repo_secretnugetapikey_412325A9: Refreshing state... [id=cdktf-provider-tls:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavengpgprivatekeypassphrase_490DD8A9: Refreshing state... [id=cdktf-provider-tls:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.repos_cdktfprovidertls_automergelabel_3111B8C0: Refreshing state... [id=cdktf-provider-tls:automerge]
github_actions_secret.repos_cdktfprovidertls_repo_secretghtoken_98CDF4F0: Refreshing state... [id=cdktf-provider-tls:GH_TOKEN]
github_actions_secret.repos_cdktfprovidertls_repo_secretnpmtoken_867611E6: Refreshing state... [id=cdktf-provider-tls:NPM_TOKEN]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavengpgprivatekey_ACD181DD: Refreshing state... [id=cdktf-provider-tls:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovidertls_repo_secretmavenpassword_337EB0FA: Refreshing state... [id=cdktf-provider-tls:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavengpgprivatekey_4A9EE2AA: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavengpgprivatekeypassphrase_A8C3B699: Refreshing state... [id=cdktf-provider-datadog:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderdatadog_repo_secrettwineusername_33DA90FF: Refreshing state... [id=cdktf-provider-datadog:TWINE_USERNAME]
github_branch_protection.repos_cdktfproviderdatadog_mainprotection_BEF61ED6: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODU=]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretnpmtoken_0106184D: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretghtoken_79DAE67B: Refreshing state... [id=cdktf-provider-datadog:GH_TOKEN]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenusername_417CB76E: Refreshing state... [id=cdktf-provider-datadog:MAVEN_USERNAME]
github_issue_label.repos_cdktfproviderdatadog_automergelabel_EBE4A0F2: Refreshing state... [id=cdktf-provider-datadog:automerge]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenstagingprofileid_AFC517AE: Refreshing state... [id=cdktf-provider-datadog:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderdatadog_repo_secrettwinepassword_69B75D38: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretmavenpassword_31006FC4: Refreshing state... [id=cdktf-provider-datadog:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderdatadog_repo_secretnugetapikey_626FE559: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderazurerm_repo_secrettwineusername_AFACB80D: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretghtoken_BD7C2F62: Refreshing state... [id=cdktf-provider-azurerm:GH_TOKEN]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavengpgprivatekey_471F3A12: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.repos_cdktfproviderazurerm_automergelabel_9D468D52: Refreshing state... [id=cdktf-provider-azurerm:automerge]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_actions_secret.repos_cdktfproviderazurerm_repo_secrettwinepassword_56930980: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_branch_protection.repos_cdktfproviderazurerm_mainprotection_C1C7E36E: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODI=]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenpassword_5B319FA8: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavengpgprivatekeypassphrase_A589C635: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretnugetapikey_399523C2: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenusername_814A90C7: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_USERNAME]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretnpmtoken_FEB5068F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_cdktfproviderazurerm_repo_secretmavenstagingprofileid_4537E488: Refreshing state... [id=cdktf-provider-azurerm:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavengpgprivatekeypassphrase_A18AEF45: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenstagingprofileid_04204128: Refreshing state... [id=cdktf-provider-aws:MAVEN_STAGING_PROFILE_ID]
github_issue_label.repos_cdktfprovideraws_automergelabel_303B185E: Refreshing state... [id=cdktf-provider-aws:automerge]
github_actions_secret.repos_cdktfprovideraws_repo_secretghtoken_8F2F704A: Refreshing state... [id=cdktf-provider-aws:GH_TOKEN]
github_branch_protection.repos_cdktfprovideraws_mainprotection_B7F72919: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3MzA0ODE=]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenusername_3AF9367E: Refreshing state... [id=cdktf-provider-aws:MAVEN_USERNAME]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]
github_actions_secret.repos_cdktfprovideraws_repo_secretnpmtoken_E55DA3E1: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_actions_secret.repos_cdktfprovideraws_repo_secrettwinepassword_412DB927: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavenpassword_F3C3F5FC: Refreshing state... [id=cdktf-provider-aws:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfprovideraws_repo_secretnugetapikey_1D701175: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_cdktfprovideraws_repo_secretmavengpgprivatekey_F2F1BC5C: Refreshing state... [id=cdktf-provider-aws:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfprovideraws_repo_secrettwineusername_BE9CD041: Refreshing state... [id=cdktf-provider-aws:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenusername_F1D7EADB: Refreshing state... [id=cdktf-provider-azuread:MAVEN_USERNAME]
github_team_repository.repos_cdktfproviderazuread_managingteam_0135A009: Refreshing state... [id=3949435:cdktf-provider-azuread]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenpassword_09A80D59: Refreshing state... [id=cdktf-provider-azuread:MAVEN_PASSWORD]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavengpgprivatekey_533FE21D: Refreshing state... [id=cdktf-provider-azuread:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repos_cdktfproviderazuread_repo_secretghtoken_9F72F2BC: Refreshing state... [id=cdktf-provider-azuread:GH_TOKEN]
github_actions_secret.repos_cdktfproviderazuread_repo_secrettwinepassword_A2505DAF: Refreshing state... [id=cdktf-provider-azuread:TWINE_PASSWORD]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavengpgprivatekeypassphrase_BBB084AC: Refreshing state... [id=cdktf-provider-azuread:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repos_cdktfproviderazuread_repo_secrettwineusername_A6332DDB: Refreshing state... [id=cdktf-provider-azuread:TWINE_USERNAME]
github_actions_secret.repos_cdktfproviderazuread_repo_secretnpmtoken_9741769E: Refreshing state... [id=cdktf-provider-azuread:NPM_TOKEN]
github_issue_label.repos_cdktfproviderazuread_automergelabel_08BC2A82: Refreshing state... [id=cdktf-provider-azuread:automerge]
github_actions_secret.repos_cdktfproviderazuread_repo_secretmavenstagingprofileid_C652BC4B: Refreshing state... [id=cdktf-provider-azuread:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repos_cdktfproviderazuread_repo_secretnugetapikey_923C4CA4: Refreshing state... [id=cdktf-provider-azuread:NUGET_API_KEY]
github_branch_protection.repos_cdktfproviderazuread_mainprotection_F5F1D327: Refreshing state... [id=BPR_kwDOGGjeT84BUxhr]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_managingteam_E627D265" {
      ~ etag       = "W/\"d9d760115d04368374108704393dbc861370a6eb7285743d6dd1086a734c20f1\"" -> "W/\"236dffb68cd84d1011ea75d1a7876a8c3a4fd50e939a857b4b6ee1ad87918e31\""
        id         = "3949435:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_managingteam_F33627F0" {
      ~ etag       = "W/\"b8b4ee331ab93b3500dc542727af4fca1111941fe3cb28dce4fcad67470182f4\"" -> "W/\"5676b77f51354680f08f4db8246763bd67700aca22d72636db2c13379ebbfda0\""
        id         = "3949435:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudinit_managingteam_8459E4BF has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudinit_managingteam_8459E4BF" {
      ~ etag       = "W/\"a73e86f66904dfcb31cb85600ffaf3dee6935a971b96d873f0474b1650b26e05\"" -> "W/\"6c4ac2edbc7be7e4615c5cd2d7cbd496fad87d100b216aa248499d8d6880512e\""
        id         = "3949435:cdktf-provider-cloudinit"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpostgresql_repo_9CD37AD7" {
      ~ etag                   = "W/\"30a782ff8a6647c29d625da0db88fc7f09fc1213561273afef45618b515f925b\"" -> "W/\"c1850a2969facc152a1d6135de32a3bf04ec2121c6ea7b77ed236eca3787497f\""
        id                     = "cdktf-provider-postgresql"
        name                   = "cdktf-provider-postgresql"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_managingteam_94F669F5" {
      ~ etag       = "W/\"b3ed4ceb4763f2b0fb9a9764b739feda97cd175dd55db90b21243411d44f076d\"" -> "W/\"9b971d75ea53ec03ba2cb04eea0651d0f27e4b06092a37de3232ad766529f189\""
        id         = "3949435:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderlocal_repo_4D7B21AD has been changed
  ~ resource "github_repository" "repos_cdktfproviderlocal_repo_4D7B21AD" {
      ~ etag                   = "W/\"8388b9aed766812f5d850dff07269ff78d81bac22b534fa12c2d7af4a9eaaaf6\"" -> "W/\"df47428aeaaa9884cdaa0f59dbbf62675f076329f831bb5e9202813eb797d00f\""
        id                     = "cdktf-provider-local"
        name                   = "cdktf-provider-local"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_managingteam_9604098C" {
      ~ etag       = "W/\"79a2b75c3f4171ee28e587caa6707edf974bc754f18540b4e3a265290d963a3e\"" -> "W/\"66ef8c64053b9c7864d26e572664bd07ed4dd0ff6b67380018c036c23e04ae2f\""
        id         = "3949435:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_managingteam_DD2D4282" {
      ~ etag       = "W/\"2ba6319dafc2bc3e9eb9f6814fd4d12ce503be199998b473b60681b2ecaedf78\"" -> "W/\"f926866061ab905444eb9f392732b61439523d42c536c4a642cefb490f8d84b5\""
        id         = "3949435:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_managingteam_86F83671 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_managingteam_86F83671" {
      ~ etag       = "W/\"aa5abfdb4f88f0b73a9038986b7e795b8b3184dec8888ff90721cf28b3981c3e\"" -> "W/\"b29b3d9bd38ba7c07bcad44954f71b499707454adcc6667a349f9479cc7807e7\""
        id         = "3949435:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"670c9624c0808231222aa59976d9b84aad0448fe555fb582d8e30fd18354a527\"" -> "W/\"0ee9434048851da940f0a4757532b777f49b5faf6fef01c13401cdf78fce370d\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 has been changed
  ~ resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      ~ etag                   = "W/\"74a50f90f6e7a9342e409872fd04c9976df5c88f10523c48c7efd9b0252f0866\"" -> "W/\"8ee489fbbc8407086b60bf77b7d8a75a1c0060e1e9ef731f21ffefdf76b17991\""
        id                     = "cdktf-provider-archive"
        name                   = "cdktf-provider-archive"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"e60a34c0704a112486ebfb1ae87cb5b9959d48f12843a96436ce50362909c54b\"" -> "W/\"29ee260867304722a76e6b92a66a98a3f671c23bafd103d69385b31326ee955e\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresql_managingteam_C34F4034 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresql_managingteam_C34F4034" {
      ~ etag       = "W/\"d41b000c47592eee56f6c5b1b7ede684967ebe86fc5b5a2183160422b011038d\"" -> "W/\"d18503041a2eb3bad7df6d142839f1080c2118c4340985338ff00272a610265a\""
        id         = "3949435:cdktf-provider-postgresql"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_managingteam_9F25FC7B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_managingteam_9F25FC7B" {
      ~ etag       = "W/\"4f2c70611011c2b6c1b7ae8e1b1e799444d75f35eb2fa627cd0b3d219b12aafe\"" -> "W/\"afae00c89aa48c7cd25ffef6437bcb61a3a1bba59c7381c97dfdca82cb3a2ecf\""
        id         = "3949435:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79 has been changed
  ~ resource "github_repository" "repos_cdktfproviderkubernetes_repo_D69C3A79" {
      ~ etag                   = "W/\"80bdeda1ec25d81b141e28c6edf0defffb5ab551cc1c61370c76e394fc029e32\"" -> "W/\"9a0e3f9a807124220db057a1a5be9f40b67b93687059dfebc3d2abd89f307254\""
        id                     = "cdktf-provider-kubernetes"
        name                   = "cdktf-provider-kubernetes"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernull_repo_8A692B1D has been changed
  ~ resource "github_repository" "repos_cdktfprovidernull_repo_8A692B1D" {
      ~ etag                   = "W/\"3172523e02f1441bac23d7e60ff1dd2d4f05efd4d7ce61573ffe9099cd1398df\"" -> "W/\"ad684dac78da89d3246b53fbb82a6a0bf5679db540d54dd76049e5812986de22\""
        id                     = "cdktf-provider-null"
        name                   = "cdktf-provider-null"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_managingteam_FC9AAFD0" {
      ~ etag       = "W/\"7409118a0562355d3fed2c5543f1501383b588cd1e1690b59b2195e3702c5e53\"" -> "W/\"c36eba6b6a3e0858002976edb36931aad3a21c4047d92b18d66665be69465615\""
        id         = "3949435:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertls_managingteam_B495FE84 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertls_managingteam_B495FE84" {
      ~ etag       = "W/\"bece76966a65d840f180507823c11b6e25d8c913d0fd69fb4c8ef398675841ef\"" -> "W/\"ad0d2ad1e6beecfb8b9adad7f182b1a405c27cd601f934d7f276cf84ee3033df\""
        id         = "3949435:cdktf-provider-tls"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergithub_repo_66B8E54A has been changed
  ~ resource "github_repository" "repos_cdktfprovidergithub_repo_66B8E54A" {
      ~ etag                   = "W/\"6f1be69b3290e114ceee7feb5033e70aa54d6c5a2ef1fac46c5d4a101ed9b722\"" -> "W/\"631e86386f6911e8310880857fc85e6856cd249cedde2862fc9475eae40166f8\""
        id                     = "cdktf-provider-github"
        name                   = "cdktf-provider-github"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_managingteam_0280CE60 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_managingteam_0280CE60" {
      ~ etag       = "W/\"2e4c57e866c3277de83fc1083b7fcf55900c8364b8eafa0e80e1389cb772a7a3\"" -> "W/\"6c8b7fb29bbc672cf26a667a79cbfb9f6da998ac775080665402370d446177c9\""
        id         = "3949435:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfrepositorymanager_repo_9D19EE52 has been changed
  ~ resource "github_repository" "repos_cdktfrepositorymanager_repo_9D19EE52" {
      ~ etag                   = "W/\"ae1bca35166e947f87cfe1ebe2df53ada168d37b15b880074edaaa22b1aa705d\"" -> "W/\"57a7f65eb5d2410b4146898f0436372c91b1ac8ae3ac53d26c9b00ee2ba18ca2\""
        id                     = "cdktf-repository-manager"
        name                   = "cdktf-repository-manager"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_managingteam_26C4AF5F has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_managingteam_26C4AF5F" {
      ~ etag       = "W/\"a52a104cafd49824fa5b924361aa81efe54a3c9379e806c781503e4c8cb1007b\"" -> "W/\"228a9be04f269ce867cb3159d2591aca79ef652a7b50c59eae9ff6f8e84b3c10\""
        id         = "3949435:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazurerm_repo_19E06DC3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazurerm_repo_19E06DC3" {
      ~ etag                   = "W/\"b8efa05b82c9b7bd6b8f04a3fdf8fcc6852dd1cdc96fe50d595cf5ffd809829a\"" -> "W/\"fc21f478c04fbb02d89b32c16949b6dcff28dfb40bcb5e2e956421e0dacf7923\""
        id                     = "cdktf-provider-azurerm"
        name                   = "cdktf-provider-azurerm"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_managingteam_455152F1" {
      ~ etag       = "W/\"284d4b42810c43b212f6c70147577e3ca8776db8ba5a7ce11d1de29aba07be6b\"" -> "W/\"b00565091119d5cc254ef0ecb53dc1d2c2ca591cf1e4fd4a1304cf1a7d681bae\""
        id         = "3949435:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdocker_repo_45A47809 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdocker_repo_45A47809" {
      ~ etag                   = "W/\"cc732cdf8b5cbc8cf34448e065cee91647f297dac1ef7767b66871fa0c21bf65\"" -> "W/\"dc9b3ccea568cca0bf72abcb2db75a43a8b7e7acf3ee04c7ffd1aba11496e959\""
        id                     = "cdktf-provider-docker"
        name                   = "cdktf-provider-docker"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_managingteam_9DD6F017" {
      ~ etag       = "W/\"14e1457214629b37ddd7dd56272df19dfee2aa64df455ffbef1a4f6cbfeaec6d\"" -> "W/\"6a093d2c520e5799eb206be04a6b2a6815ea67406864bdcd5d97483c3be7ea85\""
        id         = "3949435:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_managingteam_C1D890C2" {
      ~ etag       = "W/\"f6e46638db06cf71c5c6c5b9be11f244797626f495580d57d12a5f6ba14514b4\"" -> "W/\"61a3a8895185dfaf9faa03e8b254522abcab03ae4b86f12643779ac9c892d347\""
        id         = "3949435:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazuread_repo_A398ECE6 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazuread_repo_A398ECE6" {
      ~ etag                   = "W/\"bed382da834c23e87211f4559bfee9b98792458f4a92fb24e643ca93917947d0\"" -> "W/\"0c21e613b89989cde3b8557d5a2a5845686e48da636c1937031dc248a6d843a4\""
        id                     = "cdktf-provider-azuread"
        name                   = "cdktf-provider-azuread"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertls_repo_E6EAEEBE has been changed
  ~ resource "github_repository" "repos_cdktfprovidertls_repo_E6EAEEBE" {
      ~ etag                   = "W/\"f7192695e2558e5d8bbe3d59bb9c427156db61e72b51b063c3299bc317c6dfae\"" -> "W/\"7e0d2c91fcdd94f69e029552b9cff3a71423d72bf514a0e5bd40ad05e2096816\""
        id                     = "cdktf-provider-tls"
        name                   = "cdktf-provider-tls"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazuread_managingteam_0135A009 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazuread_managingteam_0135A009" {
      ~ etag       = "W/\"7ddd366944dae4c6fe14fce75899c30fa236f04b64d5638511b08ac5254c8c0b\"" -> "W/\"52f354fb2a0317b6d444093d1f68bbef474778a335914dfad34c0146f527abe5\""
        id         = "3949435:cdktf-provider-azuread"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdatadog_repo_3C8DEE00" {
      ~ etag                   = "W/\"59a75607c9540b1056b2ddaf22f66f35baac249af5fd61d7c6629a6734351ab9\"" -> "W/\"cbfaa99d7243860b3e77dfec31f4729a93afcfdff324e058d4dac9e77879805d\""
        id                     = "cdktf-provider-datadog"
        name                   = "cdktf-provider-datadog"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidercloudinit_repo_4E4D12FF has been changed
  ~ resource "github_repository" "repos_cdktfprovidercloudinit_repo_4E4D12FF" {
      ~ etag                   = "W/\"15ac0ac3fcbae564aab80bcee29f8270f89ee7736ab768cf6651bf8ccc09bace\"" -> "W/\"4c77c22764786fd2c2834b0b4b4bb4256ced01c58721d5510c1a28d1c2e79c92\""
        id                     = "cdktf-provider-cloudinit"
        name                   = "cdktf-provider-cloudinit"
        # (26 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfproviderpostgresql_mainprotection_BE8DB09C has been changed
  ~ resource "github_branch_protection" "repos_cdktfproviderpostgresql_mainprotection_BE8DB09C" {
        id                     = "BPR_kwDOGR9aB84BWiJK"
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"310495e22d4a4949828c4845d2aabd47eaf335be492c41e52bd9acff9b91ca5c\"" -> "W/\"c59f43f17751fc431dbf5f2d5281640c53c8a71b825f8d03334918ad4cefb56c\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_branch_protection.repos_cdktfprovidercloudinit_mainprotection_22F8B7FC has been changed
  ~ resource "github_branch_protection" "repos_cdktfprovidercloudinit_mainprotection_22F8B7FC" {
        id                     = "BPR_kwDOGR9aGs4BWiI7"
      + push_restrictions      = []
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # github_repository.repos_cdktfproviderpagerduty_repo_0AF36FE3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpagerduty_repo_0AF36FE3" {
      ~ etag                   = "W/\"adac9550d72d7cd156957b4ce2161c31f63fee2b01477128da943daa604546a5\"" -> "W/\"c052b8183123dabf275f3e0b00b8f0a33eee9e16195dadac75c9496d112cda83\""
        id                     = "cdktf-provider-pagerduty"
        name                   = "cdktf-provider-pagerduty"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderexternal_repo_2177D259 has been changed
  ~ resource "github_repository" "repos_cdktfproviderexternal_repo_2177D259" {
      ~ etag                   = "W/\"58877805c15c3f7026ffa327e30cd8398eacef5c48e4b69fdb795539346c9f3c\"" -> "W/\"b932654fff13d97d675a4632fb4a897bbee4a9b26e916679b9cb3b4c70395178\""
        id                     = "cdktf-provider-external"
        name                   = "cdktf-provider-external"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergoogle_repo_3D7769E0 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergoogle_repo_3D7769E0" {
      ~ etag                   = "W/\"a57666c7b7ef21a006750e7ad4030ff0d662d4007df95dd667da6313a0b20bf7\"" -> "W/\"4712c012c8f146e5b6dee9c398c52f68bad3d692800f7e74ca53c1fbf2da5a50\""
        id                     = "cdktf-provider-google"
        name                   = "cdktf-provider-google"
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretghtoken_5CAEF33E will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretghtoken_5CAEF33E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretmavengpgprivatekey_1A337527 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretmavengpgprivatekey_1A337527" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretmavengpgprivatekeypassphrase_884BBC5C will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretmavengpgprivatekeypassphrase_884BBC5C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenpassword_9FC1077F will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretmavenpassword_9FC1077F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenstagingprofileid_3B8E68F8 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretmavenstagingprofileid_3B8E68F8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretmavenusername_9DDCAD6E will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretmavenusername_9DDCAD6E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretnpmtoken_2AF19A38 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretnpmtoken_2AF19A38" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretnugetapikey_8B2B96A8 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretnugetapikey_8B2B96A8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secrettwinepassword_AE46BBD1 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secrettwinepassword_AE46BBD1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secrettwineusername_715D77D4 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secrettwineusername_715D77D4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repos_cdktfproviderhelm_mainprotection_DD165CB9 will be created
  + resource "github_branch_protection" "repos_cdktfproviderhelm_mainprotection_DD165CB9" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-helm"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
            ]
          + strict   = true
        }
    }

  # github_issue_label.repos_cdktfproviderhelm_automergelabel_F8D0E361 will be created
  + resource "github_issue_label" "repos_cdktfproviderhelm_automergelabel_F8D0E361" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-helm"
      + url        = (known after apply)
    }

  # github_repository.repos_cdktfproviderhelm_repo_E5C9B6C8 will be created
  + resource "github_repository" "repos_cdktfproviderhelm_repo_E5C9B6C8" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for helm."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-helm"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "helm",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_team_repository.repos_cdktfproviderhelm_managingteam_C2C08744 will be created
  + resource "github_team_repository" "repos_cdktfproviderhelm_managingteam_C2C08744" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-helm"
      + team_id    = "3949435"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repos_providerRepos_C7679B58 = [
        # (9 unchanged elements hidden)
        "git@github.com:hashicorp/cdktf-provider-google.git",
      + (known after apply),
        "git@github.com:hashicorp/cdktf-provider-kubernetes.git",
        # (6 unchanged elements hidden)
    ]
```

</details>

*Pusher: @ansgarm, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*